from userbot.Config import Config # Ok
# for update code when i need it
HEROKU_APP_NAME = Config.HEROKU_APP_NAME or None
HEROKU_API_KEY = Config.HEROKU_API_KEY or None
UPSTREAM_REPO_BRANCH = Config.UPSTREAM_REPO_BRANCH
UPSTREAM_REPO = "https://github.com/EG-THON/Egypack"
T = Config.COMMAND_HAND_LER

Up_1 = "𝐒𝐨𝐮𝐫𝐜𝐞 𝐄𝐠𝐲𝐭𝐡𝐨𝐧 - 𝐔𝐩𝐝𝐚𝐭𝐞 𝐌𝐬𝐠.\n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n** ◄ يوجـد تحـديث جديد لسورس ايجيثون.**\n`{}`\n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n • Ch : @EGYTHON"
Up_2 = "**تنصيب تحديث ايجيثون قيد التقدم ، يرجى الانتظار حتى تنتهي العملية ، وعادة ما يستغرق التحديث من 4 إلى 5 دقائق.**"
Up_3 = "𝐒𝐨𝐮𝐫𝐜𝐞 𝐄𝐠𝐲𝐭𝐡𝐨𝐧 - 𝐔𝐩𝐝𝐚𝐭𝐞 𝐌𝐬𝐠.\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**◄ تم التحديث بنجاح ✅**\n ** جارٍ إعادة تشغيل بوت ايجيثون ، انتظر .**"
Up_4 = "𝐒𝐨𝐮𝐫𝐜𝐞 𝐄𝐠𝐲𝐭𝐡𝐨𝐧 - 𝐔𝐩𝐝𝐚𝐭𝐞 𝐌𝐬𝐠.\n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**◄ جاري البحث عن التحديثات.**"
Up_5 = "𝐒𝐨𝐮𝐫𝐜𝐞 𝐄𝐠𝐲𝐭𝐡𝐨𝐧 - 𝐔𝐩𝐝𝐚𝐭𝐞 𝐌𝐬𝐠.\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**◄ يتم تنصيب التحديث  انتظر.**"
Up_6 = "𝐒𝐨𝐮𝐫𝐜𝐞 𝐄𝐠𝐲𝐭𝐡𝐨𝐧 - 𝐔𝐩𝐝𝐚𝐭𝐞 𝐌𝐬𝐠.\n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**◄ يتم تحديث بوت ايجيثون انتظر.**"

Upeor_1 = "بيانات اعتماد هيروكو غير صالحة لتنصيب ايجيثون"
Upeor_2 = "`عفوًا .. لا يمكن لبرنامج التحديث المتابعة بسبب "
Upeor_3 = "حدثت بعض المشاكل`\n\n**تتبع السجل:**\n"
Upeor_4 = "𝐒𝐨𝐮𝐫𝐜𝐞 𝐄𝐠𝐲𝐭𝐡𝐨𝐧 - 𝐔𝐩𝐝𝐚𝐭𝐞 𝐌𝐬𝐠.\n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n** ◄ اضبط المتغيرات المطلوبة أولاً لتحديث بوت ايجيثون .**",

Upend = "\n𝐒𝐨𝐮𝐫𝐜𝐞 𝐄𝐠𝐲𝐭𝐡𝐨𝐧 - 𝐔𝐩𝐝𝐚𝐭𝐞 𝐌𝐬𝐠.\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**◄ سورس ايجيثون محدث لأخر اصدار.**"
UpMsg =  f"𝐒𝐨𝐮𝐫𝐜𝐞 𝐄𝐠𝐲𝐭𝐡𝐨𝐧 - 𝐔𝐩𝐝𝐚𝐭𝐞 𝐌𝐬𝐠.\n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n◄ اضغط هنا **للتحديث السريع ↫ **[`{T}تحديث الان`] او اضغط هنا **لتنصيب التحديث** وقد يستغرق 5 دقائق ↫ [`{T}تحديث البوت`]"
