#   Egython

from userbot.Config import Config # Ok - 

USERID = Config.OWNER_ID
Name = Config.ALIVE_NAME
DEFAULTUSER = str(Name) if Name else "Egy THON"
mention = f"[{Name}](tg://user?id={USERID})"

Plugin = "userbot/plugins/{}.py"
Admin = "userbot/plugins/Admin/{}.py"
Animation = "userbot/plugins/animations/{}.py"
Tosh = "userbot/plugins/tosha/{}.py"
Assistant = "userbot/plugins/assistant/{}.py"
AssistantPm = "userbot/plugins/assistant/PmTosh/{}.py"

Xtbot = "\"TG_BOT_TOKEN\""
Xt = "TG_BOT_TOKEN"
Xe = "STRING_SESSION"

A = Config.APP_ID
H = Config.API_HASH
B = Config.TG_BOT_TOKEN
N = Config.NO_LOAD

Start = (
    """
    <------------------------------------>
         يتم تحميل ملفات السورس ايجيثون
    <------------------------------------>
    """
)

TOSHA = Config.PRIVATE_GROUP_BOT_API_ID
TBOT = Config.TG_BOT_USERNAME
T = Config.COMMAND_HAND_LER or "."
DEVL = "@Egython"

C = "**᥀︙المعادله ◄** {}\n  **- الحل ◄** {}"
Calc = (
    "𝐒𝐨𝐮𝐫𝐜𝐞 𝐄𝐠𝐲𝐭𝐡𝐨𝐧 - 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬.\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "**᥀︙قائـمه اوامر الحاسبه :** \n"
    "◄ `.حاسبه` + المعادله \n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "𝐂𝐡𝐚𝐧𝐧𝐞𝐥 𝐒𝐨𝐮𝐫𝐜𝐞 - [𝐋𝐢𝐧𝐤](t.me/Egython) ."
)

kk = [
   "╭━━━╮\n┃╭━━╯\n┃╰━━╮\n┃╭━━╯\n┃┃\n╰╯",
   "┏━━━┓\n┃┏━━┛\n┃┗━━┓\n┃┏━━┛\n┃┃\n┗┛"
]

urs = "**᥀︙نسبة نجاحك هي -** {}"
Fl = [
   "+100% 🔱🖤", "100% 🖤", "95%", "90%","85%", "80%", "75%", "70%", "65%", "60%", "55%", 
   "50%", "45%", "40%", "35%", "30%", "25%", "20%", "15%", "10%", "0%", "-0%"
]

MSGE = (
   f"𝐒𝐨𝐮𝐫𝐜𝐞 𝐄𝐠𝐲𝐭𝐡𝐨𝐧 - 𝐔𝐩𝐭𝐚𝐭𝐞 𝐌𝐚𝐬𝐠.\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**᥀︙المستخدم -** {mention}\n**᥀︙البوت - {TBOT}**\n**᥀︙للمساعده - {DEVL}**\n**اكتب {T}بنك لتحقق اذا ما كان البوت يعمل**"
)

Tlk = " تم استرداد "
IS = "لايمكن تحميل - {} بسبب {} ."

#- TOSH is the most beautiful girl in the world -#
ICSJ = "<ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ>"
StartLoaded = "<ⵧⵧⵧⵧⵧⵧ╏- Egy PLUGINS -╏ⵧⵧⵧⵧⵧⵧ>"
ASSISTANT = "<ⵧⵧⵧⵧⵧⵧ╏- Egy ASSISTANT -╏ⵧⵧⵧⵧⵧⵧ>"
KIMOTOSHA = "<ⵧⵧⵧⵧⵧⵧⵧⵧ╏- Egy TOSHA -╏ⵧⵧⵧⵧⵧⵧⵧ>"
ANIMATIONS = "<ⵧⵧⵧⵧⵧⵧ╏- Egy ANIMATIONS -╏ⵧⵧⵧⵧⵧ>"
ADMIN = "<ⵧⵧⵧⵧⵧ╏- Egy ADMIN TOOLS -╏ⵧⵧⵧⵧⵧ>"
ASSISTANTPM = "<ⵧⵧⵧⵧⵧ╏- Egy ASSISTANT PM -╏ⵧⵧⵧⵧⵧ>"
ICSW = "<ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ>"
# --- MESSI IS THE BEST PLAYER IN THE WORLD --- #

Plg = "userbot/plugins/*.py"
Adm = "userbot/plugins/Admin/*.py"
Inm = "userbot/plugins/animations/*.py"
Tsh = "userbot/plugins/tosha/*.py"
Ast = "userbot/plugins/assistant/*.py"
Pmt = "userbot/plugins/assistant/PmTosh/*.py"

Message = (
"""بوت ايجيثون يعمل بنجاح الان
 المستخدم: {} - البوت: {} 
 @Egy_thon - اذا تريد مساعده انضم هنا"""
)

Mesg = [
    'يتم تحميل انلاين ايجيثون',
    'اكتمل تنزيل انلاين ايجيثون بدون اخطاء',
    'يتم بدء بوت ايجيثون',
    'اكتمل بدء بوت ايجيثون'
]

Quotly = [
    '**᥀︙اهلا -** {} **قم برد على الرساله**',
    '**᥀︙اهلا -** {} **التنسيق غير مدعوم**',
    '**᥀︙جاري المعـالجه….**',
    '**᥀︙قم بالرد على الرساله او قم بوضع النص قرب الامر**',
    '**᥀︙اهلا -** {} **خطا في بناء الامر**',
    '**᥀︙يرجى الغاء الحظر من البوت ~** @quotlybot'
]

Cmds = "𝐒𝐨𝐮𝐫𝐜𝐞 𝐄𝐠𝐲𝐭𝐡𝐨𝐧 - 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬.\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**᥀︙اهلا بك عزيزي اختر الاوامر التاليه**\n **م1   ↫ اوامر الادمن** \n **م2   ↫ اوامر التسليه**\n **م3   ↫ اوامر الترحيب**\n **م4   ↫ اوامر الردود**\n **م5   ↫ اوامر الرفع**\n **م6   ↫ اوامر الحمايه**\n **م7   ↫ اوامر التلكراف**\n **م8   ↫ اوامر الملصقات**\n **م9   ↫ اوامر التاك**\n **م10 ↫ اوامر الكشف**\n **م11 ↫ اوامر المجموعه**\n **م12 ↫ اوامر الترجمه**\n **م13 ↫ اوامر البحث**\n **م14 ↫ اوامر الانتحال**\n **م15 ↫ اوامر النت**\n **م16 ↫ اوامر البوت**\n **م17 ↫ اوامر الحساب**\n **م18 ↫ اوامر السورس**\n **م19 ↫ اوامر الزغـرفه**\n **م20 ↫ اوامر المتحركات**\n **م21 ↫ اوامر الهمسه**\n **م22 ↫ اوامر الالعاب**\n **م23 ↫ اوامر الحاسبه**\n **م24 ↫ اوامر هيروكو**\n **م25 ↫ اوامر الوقتـي**\n **م26 ↫ اوامر القائمة السوداء**\n **م27 ↫ اوامر التحـويلات**\n **م28 ↫ اوامر الكـشف العـام**\n **م29 ↫ اوامر ذاتيـة الـتدمير**\n **م30 ↫ اوامر الثيمـات**\n **م31 ↫ اوامر خلفيات الشاشـه**\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n𝐂𝐡𝐚𝐧𝐧𝐞𝐥 𝐒𝐨𝐮𝐫𝐜𝐞 - [𝐋𝐢𝐧𝐤](t.me/Egython) ."

# Help String - Text when u type .help!
HelpString = "𝐒𝐨𝐮𝐫𝐜𝐞𝐄𝐠𝐲𝐭𝐡𝐨𝐧 - 𝐇𝐞𝐥𝐩𝐞𝐫.\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**᥀︙اهلا بك عزيزي {} في قائمه الانلاين:**\n\n**◄ استخدم** `.مساعده واسم الاضافه`\n**لاضهار الاوامر بدون الاستخدام.**\n\n**◄ استخدم** `.شرح واسم الاضافه`\n**لاضهار الاوامر وطريقه استخدامها وفوائدها**"

# For Dev:
Devt = "𝑫𝑬𝑽 𝑼𝑺𝑬𝑹\n ► {} .".format(DEVL)

# For Echo - EchoText:
Echo = [
    '**᥀︙اهلا -** {}\n**᥀︙انه موجود بلفعل في قائمه الازعاج**',
    '**᥀︙مرحبا بك عزيزي**',
    '**᥀︙اهلا -** {} \n**᥀︙قم برد على الرساله لكي تتم اضافته الى قائمه الازعاج**',
    '**᥀︙اهلا -** {} \n**᥀︙تم ايقاف امر الازعاج**',
    '**᥀︙اهلا -** {} \n**᥀︙هذا المستخدم غير مضاف الى قائمه الازعاج**',
    '𝐒𝐨𝐮𝐫𝐜𝐞 𝐄𝐠𝐲𝐭𝐡𝐨𝐧 - 𝐄𝐜𝐡𝐨 𝐋𝐢𝐜𝐭\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**᥀︙قائمة المضافين للازعاج:**\n',
    '**- ايدي المستخدم :** `{}`\n**- ايدي الـمجموعه :** `{}`\n\n',
    '**᥀︙اهلا - {} \n**᥀︙لم تقم باضافه احد للقائمه**'
]
